app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" LIMIT $1  [["LIMIT", 1]]
---
  def index
    @blogs = Blog.all

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "My First Blog!"], ["body", "Hey! Thanks for checking out my first blog!"], ["created_at", "2019-05-08 03:52:42.834020"], ["updated_at", "2019-05-08 03:52:42.834020"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "title" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["title", "My First Blog Post!"], ["updated_at", "2019-05-10 19:14:52.061146"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)

DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 11]]
---
  def destroy
    @blog.destroy

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_blog
    @blog = Blog.friendly.find(params[:id])