app/controllers/projects_controller.rb

  def update
    @project_item = Project.find(params[:id])
    respond_to do |format|
      if @project_item.update(params.require(:project).permit(:title, :subtitle, :body))
---
UPDATE "projects" SET "subtitle" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["subtitle", "This is the subtitle"], ["updated_at", "2019-05-11 16:03:45.524231"], ["id", 3]]