app/controllers/projects_controller.rb

  def index
    @project_items = Project.all
---
SELECT "projects".* FROM "projects"

  def create
    @project_item = Project.new(params.require(:project).permit(:title, :subtitle, :body))

    respond_to do |format|
      if @project_item.save
---
INSERT INTO "projects" ("title", "subtitle", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Project"], ["subtitle", "simple project"], ["body", "Check out this cool project"], ["created_at", "2019-05-11 03:06:48.912578"], ["updated_at", "2019-05-11 03:06:48.912578"]]

  def show
    @project_item = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def edit
    @project_item = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def destroy
    # Perform the lookup
    @project_item = Project.find(params[:id])

    # Destroy/Delete the record
    @project_item.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 11]]

  def update
    @project_item = Project.find(params[:id])
    respond_to do |format|
      if @project_item.update(params.require(:project).permit(:title, :subtitle, :body))
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "projects" SET "subtitle" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["subtitle", "This is the subtitle"], ["updated_at", "2019-05-11 16:03:45.524231"], ["id", 3]]